import React, { useState } from 'react';

import './test.scss';
const questions = [
  {
    title: '1 Мехатроника –',
    variants: [
      'A)	өзінің құрамына үш фундаментальді-қолданбалы облыстың машиналар механикасы, электроника жəне ақпараттық технологиялар базалық білімін біріктіретін қазіргі заманғы бағыт;',
      'B)	тұйықталған кинематикалық тізбекті манипулятор;',
      'C)	берілген қозғалыс функцияларын орындау үшін əртүрлі техникалық құрылғыларды қолданатын техникалық жүйелер;',
      'D)	манипулятордың құрылымдық сұлбасы;',
      'E)	барлық жауаптар дұрыс. ',
    ],
    correct: 0, // 0 a дұрыс, 1 b дұрыс, 2 с дұрыс, 3 d дұрыс
  },
  {
    title: '2 Робототехника –',
    variants: [
      'A)	зерттеу объектісі роботтар болып табылатын ғылым бағыты;',
      'B)	мехатрондық құрылғыны талдау жəне синтездеумен айналысатын ғылым;',
      'C)	берілген қозғалыс функцияларын орындау үшін əртүрлі техникалық құрылғыларды қолданатын техникалық жүйелер;',
      'D)	сезім жəне ойлау мүшелері көмегімен адам немесе басқа тірі денелермен сыртқы немесе функционалдық ұқсастығы бар жұмыс істей алатын, механикалық құрылғы;',
      'E)	барлық жауаптар дұрыс. ',
    ],
    correct: 0,
  },
  {
    title: '3 Мехатрондық объектілер –',
    variants: [
      'A)	манипулятордың құрылымдық сұлбасы;',
      'B)	зерттеу объектісі роботтар болып табылатын ғылым бағыты;',
      'C)	берілген қозғалыс функцияларын орындау үшін əртүрлі техникалық құрылғыларды қолданатын техникалық жүйелер;',
      'D)	өз ара əрекеттесу жəне сыртқы ортаға əсері функцияларын орындау үшін, əртүрлі механизмдер мен машиналар, өлшегіш жəне ақпараттарды өңдеу құралдары жəне басқару жүйелері біріктірілген жүйе;',
      'E)	мехатрондық құрылғыны талдау жəне синтездеумен айналысатын ғылым.',
    ],
    correct: 3,
  },
  {
    title: '4	Бергіштер класын атаңыздар?',
    variants: [
      'A)	аналогтық, сандық, бинарлық;',
      'B)	цилиндрлік, вакуумдық, электромагниттік, сфералық;',
      'C)	айналмалы, камера-қысқыштық, ілгерілемелі, механикалық;',
      'D)	бағыттаушы, бағыт-бағдарлаушы, жанамалық;',
      'E)	дұрыс жауап жоқ.',
    ],
    correct: 0,
  },
  {
    title: '5	Робототехникалық жүйе құрамына кіретін құрамдас бөліктерін атаңыз?',
    variants: [
      'A)	ақпаратты-өлшеу	жүйе,	орындаушы	жүйе,	басқару	жүйесі, коммуникациялық жүйе;',
      'B)	аналогтық, сандық, бинарлық;',
      'C)	айналмалы, камера-қысқыштық, ілгерілемелі, механикалық;',
      'D)	бағыттаушы, бағыт-бағдарлаушы, жанамалық;',
      'E)	цилиндрлік, вакуумдық, электромагниттік, сфералық.',
    ],
    correct: 0,
  },
  {
    title: '6	РТЖ БЖ бойынша адам қатысуымен басқарылатын роботтар түрлерін атаңыз?',
    variants: [
      'A)	автоматтық, биотехникалық, интерактивті; ',
      'Б) аналогтық, сандық, бинарлық;',
      'С) бағыттаушы, бағыт-бағдарлаушы, жанамалық;',
      'D)	ақпаратты-өлшеу жүйесі, орындаушы жүйе, басқару жүйелері;',
      'E)	дұрыс жауап жоқ.',
    ],
    correct: 0,
  },
  {
    title: '7	РТЖ интерфейсін жобалаудағы негізгі принциптер:',
    variants: [
      'A)	қарапайымдылық, көрнекілік, тізбектілік;',
      'B)	сенімділік, жылдамдату, тезəрекеттілік;',
      'C)	тізбектілік, сенімділік, тезəрекеттілік;',
      'D)	өлшем, жылдамдық, қарапайымдылық;',
      'E)	барлық жауаптар дұрыс.',
    ],
    correct: 0,
  },
  {
    title: '8	Есте сақтау құрылғысы не үшін арналған?',
    variants: [
      'A)	басқа блоктармен ақпаратты алмастыру жəне сақтау үшін;',
      'B)	компьютер жəне принтер арасында ақпарат алмасу үшін;',
      'C)	принтерде ақпаратты сақтау үшін;',
      'D)	процессор жəне принтер арасындағы байланыстырушы түйін;',
      'E)	барлық жауаптар дұрыс емес.',
    ],
    correct: 0,
  },
  {
    title: '9	Күштік түрлендіргіштер жұмыс істеу принципі бойынша келесідей бөлінеді:',
    variants: [
      'А) айналмалы, камера-қысқыштық, ілгерілемелі, механикалық;',
      'B)	аналогтық, сандық, бинарлық;',
      'C)	ендік-импульстік түрлендіргіштер, басқарылатын түзеткіштер, басқарылмайтын түзеткіштер, автономдық инверторлар, жиілікті тікелей түрлендіргіштер;',
      'D)	бағыттаушы, бағыт-бағдарлаушы, жанамалық;',
      'E)	цилиндрлік, вакуумдық, электромагниттік, сфералық. ',
    ],
    correct: 2,
  },
  {
    title: '10 Қорек көзі бойынша бөлінетін ҚМ түрлері:',
    variants: [
      'A)	электромеханикалық, гидравликалық, пневматикалық;',
      'B)	бағыттаушы, бағыт-бағдарлаушы, жанамалық;',
      'C)	цилиндрлік, вакуумдық, электромагниттік, сфералық;',
      'D)	айналмалы, камера-қысқыштық, ілгерілемелі, механикалық;',
      'E)	аналогтық, сандық, бинарлық.',
    ],
    correct: 0,
  },
  {
    title: '11	Өнеркəсіптік робот не үшін арналған?',
    variants: [
      'A)	жадыда ақпаратты сақтау үшін;',
      'B)	негізгі жəне қосымша өндірістік операцияларды орындау кезінде адам қатысуынсыз оның кейбір қозғалыс жəне ойлау функцияларын орындау үшін;',
      'C)	басқа блоктармен ақпаратты алмастыру жəне сақтау үшін;',
      'D)	принтерде ақпаратты сақтау үшін;',
      'E)	барлық жауаптар дұрыс.',
    ],
    correct: 1,
  },
  {
    title: '12	Орындаушы деңгейде қандай есептер шешіледі?',
    variants: [
      'A)	кинематиканың кері есебі шешіледі;',
      'B)	кинематиканың тікелей есебі шешіледі;',
      'C)	мехатрондық модульді басқару есебі шешіледі;',
      'D)	манипулятордың еркіндік дəрежесі анықталады;',
      'E)	барлық жауаптар дұрыс емес.',
    ],
    correct: 2,
  },
  {
    title: '13	Иерархия бойынша құрылымдық сұлбаны орналастырыңыз:',
    variants: [
      'A)	айналмалы, камера-қысқыштық, ілгерлемелі, механикалық;',
      'B)	аналогтық, сандық, бинарлық;',
      'C)	бағыттаушы, бағыт-бағдарлаушы, жанамалық;',
      'D)	стратегиялық, тактикалық, орындаушы;',
      'E)	барлық жауаптар дұрыс емес. ',
    ],
    correct: 3,
  },
  {
    title: '14 Микропроцессор дегеніміз не?',
    variants: [
      'A)	бір немесе бірнеше үлкен интегралдық сұлбада, өте үлкен интегралдық сұлбаларда программалық басқарылатын құрылғы, ол ақпаратты өңдеу жəне оны басқару үрдісін жүзеге асырады, функционалды түрде аяқталған сандық қондырғы;',
      'B)	бірнеше қозғалыс деңгейлері жəне қайта программалайтын басқару қондырғысы бар манипулятордан тұратын автоматты стационарлы немесе жылжымалы машина;',
      'C)	роботтар жəне көмекші жабдықтары бар көп функционалды өндірістік цехтар түрінде икемді өндірістік жүйелерден тұратын, басқарылатын өндірістік жүйе жəне қосымша қондырғы;',
      'D)	роботтар, көмекші жабдықтары жəне басқаруы бар өндірістік кешендер түрінде икемді өндірістік модульдардан тұратын, басқарылатын, көп функционалды өндірістік цех;',
      'E)	технологиялық жабдықтың бірнешеуінен, роботтан, қосымша жабдықтардан жəне басқару жүйесінен тұратын бірфункционалды өндірістік кешен.',
    ],
    correct: 0,
  },
  {
    title: '15	Роботтардың негізгі жіктелу белгілерін атаңыз?',
    variants: [
      'A)	жылдамдық, үдеу, жүккөтергіштігі;',
      'B)	басқару жүйесінің түрі, технологиялық тағайындалуы, кинематикалық сұлба түрі, жүк көтергіштігі, жетек түрі, қозғалтқыштық дəрежесі саны;',
      'C)	орнату əдісі, жұмыс зонасының көрсеткіштері, позицияланудың дəлдігі, еркіндік дəрежесінің саны, жүккөтергіштігі, жетектер түрі, қармағыш түрі;',
      'D)	қолдану ауданы, жинақы сұлбасы, қармағыш бағасы;',
      'E)	техникалық көрсеткіштері, унификация.',
    ],
    correct: 1,
  },
  {
    title: '16	Өнеркəсіптік роботтың анықтамасын беріңіз?',
    variants: [
      'A)	роботтар жəне көмекші жабдықтары бар көп функционалды өндірістік цехтар түрінде икемді өндірістік жүйелерден тұратын, басқарылатын өндірістік жүйе жəне қосымша қондырғы;',
      'B)	бір немесе бірнеше үлкен интегралдық сұлбада, өте үлкен интегралдық сұлбаларда программалық басқарылатын құрылғы, ол ақпаратты өңдеу жəне оны басқару үрдісін жүзеге асырады, функционалды түрде аяқталған сандық қондырғы;',
      'C)	стационарлық немесе қозғалмалы автоматтық машина, ол бірнеше қозғалыс дəрежелері бар манипулятор түріндегі атқару құрылғысынан жəне өндірістік үрдісте қозғалу жəне басқару функциясын орындауға арналған қайта программаланатын құрылғы;',
      'D)	технологиялық жабдықтың бірнешеуінен, роботтан, қосымша жабдықтардан жəне басқару жүйесінен тұратын бірфункционалды өндірістік кешен;',
      'E)	роботтар, көмекші жабдықтары жəне басқаруы бар өндірістік кешендер түрінде икемді өндірістік модульдардан тұратын, басқарылатын, көп функционалды өндірістік цех.',
    ],
    correct: 2,
  },
  {
    title: '17	Жылдамдық профилінің өлшемін көрсетіңіз?',
    variants: ['A)	0,1сек;', 'B)	өлшемсіз;', 'C)	10 сек;', 'D)	1 сағ;', 'E)	барлық жауаптар дұрыс.'],
    correct: 1,
  },
  {
    title: '18	Интеллектуалды	басқару	технологияларына	қандай	технологиялар жатады?',
    variants: [
      'A)	БЕСҚ (ПЗУ), ОЕСҚ (ОЗУ), нейрожелілік құрылым;',
      'B)	нақты жүйе, желілік құрылым, кэш-жады;',
      'C)	манипулятордың жұмыс органының бірқалыпты, үздіксіз қозғалысын қамтамасыз ететін жүйе;',
      'D)	тақ жүйе, нейрожелілік құрылым, ассоциативтік жады;',
      'E)	барлық жауаптар дұрыс.',
    ],
    correct: 3,
  },
  {
    title: '19	Робототехникалық	жүйенің	модулі	қандай	элементтерден	жəне жүйелерден тұрады?',
    variants: [
      'A)	басқару жүйесі,	ақпаратты-өлшеуіш	жүйе,	берілістік	механизмдер қозғалтқышы;',
      'B)	қадағалаушы жүйелер көмегімен басқарылатын араластырып берілген механизмдер жүйесі;',
      'C)	қозғалыстың қайтақосылуын немесе манипулятордың осы нүктелерде тоқтауын қамтамасыз ететін позициялау нүктесі аз жүйе;',
      'D)	адам-оператормен берілген командаларды роботпен тізбектей орындау;',
      'E)	манипулятордың жұмыс органының бірқалыпты, үздіксіз қозғалысын қамтамасыз ететін жүйе.',
    ],
    correct: 0,
  },
  {
    title: '20	Тактикалық	деңгейде	басқару	кешені	қандай	функцияларды орындайды?',
    variants: [
      'A)	стратегиялық деңгейден командаларды қабылдау, сенсорлық датчик блогында ақпаратты өңдеу, орындаушы деңгейге басқару программасын беру;',
      'B)	орындаушы деңгейден командаларды қабылдау, орындаушы деңгейді басқару;',
      'C)	стратегиялық деңгейде ақпараттарды өңдеу;',
      'D)	ақпаратты жадыда сақтау;',
      'E)	барлық жауаптар дұрыс.',
    ],
    correct: 0,
  },
  {
    title: '21	РТЖ құрамына қандай негізгі элементтер кіреді:',
    variants: [
      'A)	орындаушы механизм, қондырғы, аппараттық жəне программалық құралдар, ақпаратты-өлшеуіш, коммуникациялық жүйе;',
      'B)	адаптивті, контурлы, көшіру қондырғылары;',
      'C)	орындаушы механизм, интеллектуалдық құралдар, коммуникациялық жүйе;',
      'D)	программалық, көшірме, интеллектуалдық құралдар;',
      'E)	барлық жауаптар дұрыс.',
    ],
    correct: 0,
  },
  {
    title:
      '22	Электргидравликалық ҚМ-на қарағанда пневматикалық ҚМ-ның негізгі артықшылықтары қандай?',
    variants: [
      'A)	жоғары энергия сыйымдылық, агрегатты-модулді қағиданы қолдану мүмкіндігі;',
      'B)	тез	əсер	етуі,	өрт-жарылғыш	қауіпсіздігі,	құрылмасының	жəне пайдаланудың қарапайымдылығы;',
      'C)	жылдамдық, үдеу, жүк көтергіштігі;',
      'D)	бағыттаушы, бағдарлаушы, жанама;',
      'E)	дұрыс жауабы жоқ.',
    ],
    correct: 1,
  },
  {
    title: '23	Ақпараттық-өлшеуіш жүйе неден тұрады?',
    variants: [
      'A)	программалық, көшірме құралдар;',
      'B)	манипулятордың жұмыс органы, қозғалтқыш, бергіштер;',
      'C)	механизм, жетек, БЖ;',
      'D)	бергіштер, техникалық көру жүйесі, интерфейсті қондырғылар;',
      'A)	дұрыс жауабы жоқ.',
    ],
    correct: 3,
  },
  {
    title: '24	Тағайындалуына байланысты роботтар қалай жіктелінеді?',
    variants: [
      'A)	манипуляциялық, ақпараттық, мобильдік, роботтар-экзосүлбе;',
      'B)	технологиялық, көтерме-транспорттық жəне əмбебап;',
      'C)	программалық, көшірме, интеллектуалды;',
      'D)	адаптивті, көшірме, контурлы;',
      'E)	барлық жауаптар дұрыс.',
    ],
    correct: 0,
  },
  {
    title: '25	Винчестердің басқару кешені дегеніміз-',
    variants: [
      'A)	жеке процессоры, жадысы, кіріс/шығыс қондырғылары бар-өз бетімен жұмыс істейтін микрокомпьютер;',
      'B)	манипулятордың жұмыс органының бірқалыпты, үздіксіз қозғалысын қамтамасыз ететін жүйе;',
      'C)	адам-оператормен берілген командаларды роботпен тізбектей орындау;',
      'D)	бір немесе бірнеше үлкен интегралдық сұлбада, өте үлкен интегралдық сұлбаларда программалық басқарылатын құрылғы, ол ақпаратты өңдеу жəне оны басқару үрдісін жүзеге асырады, функционалды түрде аяқталған сандық қондырғы;',
      'E)	дұрыс жауабы жоқ.',
    ],
    correct: 0,
  },
  {
    title: '26	Робототехникалық жүйелердің жіктелуін көрсетіңіз?',
    variants: [
      'A)	автоматтық, биотехникалық, интерактивтік;',
      'B)	манипуляциялық, ақпараттық, мобильдік, роботтар-экзоскелетондар;',
      'C)	технологиялық, көтергіш-транспорттық, əмбебап;',
      'D)	аналогтық, сандық, бинарлы;',
      'E)	программалық, көшірме, интеллектуалды. ',
    ],
    correct: 0,
  },
  {
    title: '27 Интерфейс дегеніміз не?',
    variants: [
      'A)	арнайы қосымша (көмекші) сұлбалар мен құрылғылар;',
      'B)	жеке процессоры, жадысы, кіріс/шығыс қондырғылары бар-өз бетімен жұмыс істейтін микрокомпьютер;',
      'C)	манипулятордың жұмысшы органы;',
      'D)	басқару жүйесінің түрі;',
      'E)	манипулятордың жұмыс органының бірқалыпты, үздіксіз қозғалысын қамтамасыз ететін жүйе.',
    ],
    correct: 0,
  },
  {
    title: '28 «Мехатроника» термині келесі бағыттардың атауларынан шыққан:',
    variants: [
      'A)	механика жəне электроника;',
      'B)	механика жəне кибернетика;',
      'C)	механика жəне машинажасау;',
      'D)	механика жəне робототехника;',
      'E)	механика жəне жүйелітехника.',
    ],
    correct: 0,
  },
  {
    title: '29 Робототехникалық жүйелер дегеніміз не?',
    variants: [
      'A)	жүйеде бір немесе бірнеше роботтардың жұмыс ңстеуін сипаттайтын техникалық жүйелер; ',
      'B) манипулятордың жұмыс органының бірқалыпты, үздіксіз қозғалысын қамтамасыз ететін жүйе;',
      'C)	қозғалыстың қайтақосылуын немесе манипулятордың осы нүктелерде тоқтауын қамтамасыз ететін позициялау нүктесі аз жүйе;',
      'D)	қадағалаушы жүйелер көмегімен басқарылатын араластырып берілген механизмдер жүйесі;',
      'E) басқару жүйесінің түрі.',
    ],
    correct: 0,
  },
  {
    title: '30 Роботтандырылған технологиялық кешендер дегеніміз не?',
    variants: [
      'A)	өндірістің басқа да кіріс жəне шығыс ағындарымен өзара байланыстың автоматтандырылған жұмысын қаматамасыз ететін, негізгі жəне қосымша жабдықтардан, бір немесе бірнеше өнеркəсіптік роботтардан тұратын, автономды қызмет ететін өндірістің технологиялық құралдарының жиынтығы;',
      'B)	басқару жүйесінің түрі;',
      'C)	қозғалыстың қайтақосылуын немесе манипулятордың осы нүктелерде тоқтауын қамтамасыз ететін позициялау нүктесі аз жүйе;',
      'D)	қадағалаушы жүйелер көмегімен басқарылатын араластырып берілген механизмдер жүйесі;',
      'E)	жүйеде бір немесе бірнеше роботтардың жұмыс істеуін сипаттайтын техникалық жүйелер.',
    ],
    correct: 0,
  },

  // {
  //   title: '',
  //   variants: [],
  //   correct: 2,
  // },
];

function Result({ correct }) {
  return (
    <div className="result">
      <img src="https://cdn-icons-png.flaticon.com/512/2278/2278992.png" />
      <h2>
        Сіз {questions.length} сұрақтын {correct} сұрағына дұрыс жауап бердіңіз{' '}
      </h2>
      <a href="/test">
        {' '}
        <button>Тестті аяқтау</button>
      </a>
    </div>
  );
}

function Game({ question, onClickVariants, step }) {
  return (
    <>
      <div className="progress">
        <div
          style={{ width: `${Math.round((step / questions.length) * 100)}%` }}
          className="progress__inner"></div>
      </div>
      <h1>{question.title}</h1>
      <ul>
        {question.variants.map((text, index) => (
          <li onClick={() => onClickVariants(index)} key={text}>
            {text}
          </li>
        ))}
      </ul>
    </>
  );
}

function Test1() {
  const [step, setStep] = useState(0);
  const [correct, setCorrect] = useState(0);
  const question = questions[step];
  const onClickVariants = (index) => {
    setStep(step + 1);

    if (index === question.correct) {
      setCorrect(correct + 1);
    }
  };
  return (
    <div className="test">
      {step !== questions.length ? (
        <Game step={step} question={question} onClickVariants={onClickVariants} />
      ) : (
        <Result correct={correct} />
      )}
    </div>
  );
}

export default Test1;
