import React from 'react';
import './work.scss';
export const Work = () => {
  const [add, setAdd] = React.useState(1);

  return (
    <div className="container">
      <div className="read">
        <div className="readLeft">
          <h2 className="read__title">Мазмұны</h2>
          <ul className="read__menu">
            <li onClick={() => setAdd(1)} className="read__item">
              <h3 className="read__menu-title1">№1 практикалық тапсырма. Түс датчигі</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(2)}>
              <h3 className="read__menu-title1">№2 практикалық тапсырма. Бағдаршам-робот</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(3)}>
              <h3 className="read__menu-title1">№3 практикалық тапсырма. Ультрадыбыс датчигі</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(4)}>
              <h3 className="read__menu-title1">
                №4 практикалық тапсырма. Робот түрлері және оларды қолдану
              </h3>
            </li>
            <li className="read__item" onClick={() => setAdd(5)}>
              <h3 className="read__menu-title1">№5 практикалық тапсырма. Гироскопиялық датчик</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(6)}>
              <h3 className="read__menu-title1">№6 практикалық тапсырма. Бүрылыстар</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(7)}>
              <h3 className="read__menu-title1">
                №7 практикалық тапсырма. Роботтардың қолданылу саласы
              </h3>
            </li>
            <li className="read__item" onClick={() => setAdd(8)}>
              <h3 className="read__menu-title1">
                №8 практикалық тапсырма. Роботтың сызық бойымен қозғалысы
              </h3>
            </li>
            <li className="read__item" onClick={() => setAdd(9)}>
              <h3 className="read__menu-title1">№9 практикалық тапсырма. Робо-сумо</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(10)}>
              <h3 className="read__menu-title1">№10 практикалық тапсырма. Датчиктер</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(11)}>
              <h3 className="read__menu-title1">№11 практикалық тапсырма. Программа блоктары</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(12)}>
              <h3 className="read__menu-title1">№12 практикалық тапсырма. Циклдік алгоритмдер</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(13)}>
              <h3 className="read__menu-title1">№13 практикалық тапсырма. Тармақталу</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(14)}>
              <h3 className="read__menu-title1">№14 зертханалық жұмыс. Роботтың алгоритмін құру</h3>
            </li>
            <li className="read__item" onClick={() => setAdd(15)}>
              <h3 className="read__menu-title1 read__menu-title2">
                №15 зертханалық жұмыс. Робо-сумо программасын құру
              </h3>
            </li>
          </ul>
        </div>
        <div className="readRight">
          {add === 1 && (
            <>
              <h2 className="readRight__title">№1 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b>Түс датчигі</b>
                </p>
                <br />
                <p>
                  <b>Датчик</b> - әртүрлі акпаратты (температура, жылдамдык, сәуле, түс, дыбыс)
                  өлшеуге арналған құрал. Датчиктер электронды және механикалык болып бөлінеді.
                </p>
                <p>
                  Датчиктер кызметіне карай жанасу датчигі, ультрадыбыс датчигі, гироскопиялык
                  датчик, түс датчигі деп 4 түрге болінеді.
                </p>
                <p>
                  1-тапсырма. Жанасу датчигі мен түс датчигін салыстырып, уксатығы мен айырмашылығын
                  анықта.
                </p>{' '}
                <br />
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img97.png" alt="" />
                </p>
                <p>2-тапсырма. Сұрақтарға жауап берейік,</p> <br />
                <p>1. Датчиктер кызметіне карай канша түрге бөлінеді?</p>
                <p>2. Түс датчигінің қанша режимі бар?</p>
                <p>3. Жобаның жүктелгендігін қайдан көруге болады?</p> <br />
                <p>3-тапсырма. Себебін анықтаңыз. Түсінгеніңізді кесте, сызба аркылы көрсетіңіз.</p>
                <br />
                <p>1. Не себепті роботтар тірі организм принципі бойынша құрастырылады?</p>
                <p>2. Неге жанасу датчигін жиі қолданамыз?</p>
              </p>
            </>
          )}{' '}
          {add === 2 && (
            <>
              <h2 className="readRight__title">№2 практикалық тапсырма. Бағдаршам-робот</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b> Бағдаршам-робот</b>
                </p>
                <br />
                <p>
                  1-тапсырма. Талдап, салыстырыныз. Scratch пен LEGO MINDSTORMS Education EV3
                  программаларының қандай үқсастығы мен айырмашылығы бар?
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img98.png" alt="" />
                </p>
                <br />
                <p>2-тапсырма. Компьютерде орындаңыз.</p>
                <br />
                <p>
                  EV3 түс датчигі алдымен кызыл түсті, одан соң жасыл түсті, үшінші кезекте кок
                  түсті корген кезде түстерді айтатын программа құрыңыз.
                </p>
                <br />
                <p>3-тапсырма. Себебін анықтаңыз.</p>
                <br />
                <p>Не себепті бағдаршам-роботты жасағанда түс датчигі маңызды рол аткарады?</p>
                <br />
                <p>4-тапсырма. Ой бөлісейік, ойынызды дәлелдеп беріңіз.</p>
                <br />
                <p>
                  Абзал LEGO MINDSTORMS Education EV3 программасында түс датчигін пайдаланып,
                  бағдаршам жобасын дайындады. Сынак барысында робот кызыл түсті көрсе де,
                  токтамады. Абзалдың жобасында қандай қателік орын алды?
                </p>
              </p>
            </>
          )}{' '}
          {add === 3 && (
            <>
              <h2 className="readRight__title">№3 практикалық тапсырма. Ультрадыбыс датчигі</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b>Ультрадыбыс датчигі</b>
                </p>{' '}
                <br />
                <p>
                  <b>Ультрадыбыс датчигі</b> - дыбыс толкындарын жіберіп, кайтып келген сигналдарды
                  оқитын жэне нысандарды тауып, оларға дейінгі қашықтықты есептейтін кұрылғы.
                </p>
                <p>
                  Ультрадыбыс датчигі жоғары жиіліктегі дыбыстык толқынды (ультрадыбыстық) жібереді,
                  нысаннан шағылысқан кері толқынды ұстайды және ультрадыбыстық импульсті қайтару
                  уақытын өлшейді, нысанға дейінгі қашықтықты жоғары дәлдік пен есептейді.
                </p>
                <p>
                  Датчик «көздерінің» айналасындағы қызыл түсті жыпылыктамайтын жарық оның{' '}
                  <b>Өлшеу</b>
                  режимінде түрғанын білдіреді.
                </p>
                <br />
                <p>1-тапсырма. Сұрақтарға жауап беріңіз.</p>
                <br />
                <p>1. Ультрадыбыс датчигі дегеніміз не?</p>
                <p>2. Ультрадыбыс датчигінің кандай ерекшеліктері бар?</p>
                <p>3. Ультрадыбыс датчигін не себепті роботка орнатамыз?</p>
                <br />
                <p>
                  2-тапсырма. Ұяшықтағы әріптердің бірдей түстерін жинап, құрастырып, тақырыпка
                  катысты термин сөздерді табыңыз.
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img99.png" alt="" />
                </p>
                <p>Үлгі: Датчик. Сары ұяшыкта орналаскан әріптерден құралған соз.</p>
                <br />
                <p>3-тапсырма. Ой бөлісейік. Жұппен бірге жұмыс істеңіз.</p>
                <br />
                <p>
                  Айсұлу ультрадыбыс датчигін пайдаланып, 23 минутта робот кұрастырды. Мадияр
                  Айсұлуга караганда 6 минуттан артық уақыт жұмсады. Ал Сәуле Мадиярга караганда 8
                  минут кем жұмсады. Кімнің канша уақыт жұмсағанын жұбыңызбен бірге анықтаңыз.
                </p>
              </p>
            </>
          )}
          {add === 4 && (
            <>
              <h2 className="readRight__title">№3 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b>Робот түрлері және оларды қолдану</b>
                </p>
                <br />
                <p>
                  Робот адамның іс-әрекетін алмастыратын автоматтандырылған, адамның қажетіне карай
                  еңбек етуге бағытталған құрылғы.
                </p>
                <p>
                  Роботтар аткаратын кызметіне карай бірнеше түрге бөлінеді: өнеркәсіптік, көліктік,
                  тұрмыстық, медициналык және білім беру роботтары т.б.
                </p>
                <br />
                <p>1-тапсырма. Компьютерде орындаңыз.</p>
                <p>
                  1. Білім беру роботын колдануга кажетті кандай программаларды білесіз? Ондай
                  программа сіздің компьютеріңізге орнатылған ба? Тексеріп көріңіз
                </p>
                <p>
                  {' '}
                  2. «Робот түрлері және оларды колдану» тақырыбы бойынша практикалық тапсырма
                  орындаңыз.
                </p>{' '}
                <br />
                <p>2-тапсырма. Талданыз.</p> <br />
                <p>
                  Адамдармен салыстырғанда роботтың кандай ерекше қасиеттерін атар едіңіз? Ойыңызды
                  жазыңыз.
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img100.png" alt="" />
                </p>
                <p>3-тапсырма. Кестені жасап, толтырыңыз.</p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img101.png" alt="" />
                </p>
              </p>
            </>
          )}{' '}
          {add === 5 && (
            <>
              <h2 className="readRight__title">№5 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b>Ультрадыбыс датчигі</b>
                </p>{' '}
                <br />
                <p>
                  <b>Гироскопиялық датчик </b> - роботтың айналу бұрышын немесе айналу жылдамдығын
                  өлшеуге арналған құрылғы.
                </p>
                <p>Гироскопиялык датчик роботтың бұрыштық бейімділігін анықтау үшін қолданылады.</p>
                <p>
                  1-тапсырма. Гироскопиялық датчик қанша режимде жұмыс істейтінін талдаңыз. Суретте
                  кандай режим корсетілген?
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img102.png" alt="" />
                </p>
                <p>
                  2-тапсырма. LEGO MINDSTORMS Education EV3 программасындағы сары палитрада кандай
                  датчиктер орналасқанын талдап айтып беріңіз. Оларды салыстырыныз.
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img103.png" alt="" />
                </p>
              </p>
            </>
          )}{' '}
          {add === 6 && (
            <>
              <h2 className="readRight__title">№6 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b> Бүрылыстар</b>
                </p>
                <p>Роботты бұру бойынша тапсырмалар орындаймыз.</p>
                <br />

                <p>
                  1-тапсырма. Суретте роботты сағат тілінің бағытымен 360°-ка бұратын программа
                  көрсетілген. Осы программаны аны LEGO MINDSTORMS Education EV3-те орындаңыз. Дайын
                  программаны роботка жүктеңіз.
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img104.png" alt="" />
                </p>
                <p>2-тапсырма. Робот канша градуста бұрылыс жасайды? Ойланып, талдау жасаңыз.</p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img105.png" alt="" />
                </p>
                <p>
                  3-тапсырма. Кестені толтырыңыз. Гироскопиялық датчик неше режимде жұмыс жасайды?
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img106.png" alt="" />
                </p>
              </p>
            </>
          )}
          {add === 7 && (
            <>
              <h2 className="readRight__title">№7 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b>Роботтардың қолданылу саласы</b>
                </p>
                <br />
                <p>1-тапсырма. Жұппен жұмыс.</p>
                <br />
                <p>
                  Жұбыңызбен акылдасып, роботтардың қандай салада қолданылатыны туралы айтыныз.
                </p>{' '}
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img107.png" alt="" />
                </p>
                <p>
                  2-тапсырма. Гироскопиялық датчиктің негізгі кызметін және жұмыс істеу принциптерін
                  топпен бірге талқылап, оны талдап жазыңыздар.
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img108.png" alt="" />
                </p>
              </p>
            </>
          )}
          {add === 8 && (
            <>
              <h2 className="readRight__title">№8 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b>Роботтың сызық бойымен қозғалысы</b>
                </p>
                <br />
                <p>
                  1-тапсырма. Программа бойынша робот кандай түстерді көреді? Робот қандай сызықпен
                  қозғалыс жасайды?
                </p>
                <br />
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img109.png" alt="" />
                </p>
                <p>
                  2-тапсырма. Кубоидты пайдаланып, көрсетілген түстерді атау программасын құрыныз.
                  Дайын программаны роботка жүктеңіз.
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img110.png" alt="" />
                </p>
                <p>
                  3-тапсырма. Түс датчигінің режимдерін еске түсіріңіздер. Кестені толтырыңыздар.
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img111.png" alt="" />
                </p>
              </p>
            </>
          )}
          {add === 9 && (
            <>
              <h2 className="readRight__title">№9 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b> Робо-сумо</b>
                </p>
                <br />
                <p>
                  Робо-сумо EV3 роботтарының ең қызықты жарыстарының бірі. Жарыста робот карсылас
                  роботты шеңберден шығарып, өзі сонда қалуы керек.
                </p>
                <br />
                <p>
                  {' '}
                  Робо-сумо отетін алаңның 2 түрі бар. Біреуі кара сызықпен қоршалған, ак шенбер,
                  екіншісі ақ сызықпен коршалган кара шенбер.
                </p>
                <br />
                <p>
                  1-тапсырма. LEGO MINDSTORMS Education EV3 программасын ашыңыз. Нұсқаулық бойынша
                  EV3 роботын Робо-сумо жарысына қатыстыру үшін оған ультрадыбыстык датчик және түс
                  датчигін орналастырыңыз.
                </p>
                <br />
                <p>
                  2-тапсырма. Себебін анықтап, жазыңыз. <br />
                  Робо-сумода ультрадыбыстык датчик кажет. Өйткені... <br /> Робо-сумода түс датчигі
                  де керек датчиктің бірі. Себебі...
                </p>
                <br />
                <p>3-тапсырма. Робо-сумо сөзіне ребус құрастырыңыз.</p>
                <br />
                <p>
                  4-тапсырма. Кегель-ринг өтетін алан мен Робо-сумо өтетін аланды салыстырыңыз.
                  Айырмашылықтары мен ұксастықтарын табыңыз.
                </p>{' '}
                <br />
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img112.png" alt="" />
                </p>
              </p>
            </>
          )}
          {add === 10 && (
            <>
              <h2 className="readRight__title">№10 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b>Датчиктер </b>
                </p>{' '}
                <br />
                <p>1-тапсырма. Жұптық жұмыс.</p>
                <p>
                  Жұбыңызбен бірге суреттегі датчиктің қызметі мен жүмыс істеу принциптерін
                  талдацыздар. Осы датчиктің канша режимі бар?
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img113.png" alt="" />
                </p>
                <p>2-тапсырма. Топтық жұмыс.</p>
                <p>
                  Топта робот жарыстары туралы кескінді сызба (постер) дайындаңыздар. Роботтардың
                  қандай жарыстары бар?
                </p>
                <br />
                <p>
                  3-тапсырма. Датчиктердің қызметін анықтаңыз. Зерттеу жүргізіп, кестені толтырыңыз.
                </p>{' '}
                <br />
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img114.png" alt="" />
                </p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img115.png" alt="" />
                </p>
              </p>
            </>
          )}
          {add === 11 && (
            <>
              <h2 className="readRight__title">№11 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b>Программа блоктары</b>
                </p>
                <p>1-тапсырма. Ребусты шешіңіз.</p>
                <br />
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img115.png" alt="" />
                </p>

                <p>2-тапсырма. Программада көрсетілген блоктың сипаттамасын жазыңыз.</p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img115.png" alt="" />
                </p>
                <p>3-тапсырма. Программадағы блоктар атауын жаз.</p>
                <p style={{ textAlign: 'center', margin: '15px 0 ' }}>
                  <img src="img/img115.png" alt="" />
                </p>
              </p>
            </>
          )}
          {add === 12 && (
            <>
              <h2 className="readRight__title">№12 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b> Циклдік алгоритмдер</b>
                </p>
                <br />
                <p>1-тапсырма. Келесі алгоритмді шығаратын программа жазыныз:</p>

                <p>
                  <ol>
                    <li>1. Робот 10 см алға жылжиды.</li>
                    <li>2. Қыскыштарды ашады.</li>
                    <li>3. Дыбыс сигналын ойнатады.</li>
                    <li>4. Қысқыштарды жабады.</li>
                    <li>5. Бастапқы нүктеге оралады.</li>
                    <li>6. Оңға бұрылады.</li>
                    <li>7. Барлық әрекеттерді 8 рет кайталайды.</li>
                  </ol>
                </p>
                <p>
                  Бағдарламаның соңында бастапқы орнына қайту үшін робот қандай бұрышпен онға
                  бұрылуы керек?
                </p>
                <br />
                <p>2-тапсырма. Бастапқы күй:</p>
                <p>
                  Робот ойын алаңында тұр. Одан 100 см қашықтықта оның радарларының көріну аймағында
                  шағын қорап орналаскан.
                </p>
                <p>Жаттыгу:</p>
                <p>
                  Қорапка дейінгі кашыктык 20 см-ге дейін азайғанша роботты алға жылжыту
                  бағдарламасын жазыңыз. Роботка бұрылыс жасаудың қажеті жок.
                </p>
                <br />
                <p>3-тапсырма. Бастапқы күй:</p>
                <p>
                  Робот ойын аланында тұр. Одан 80 см кашыктыкта шағын картон қорапшасы бар. Айналу
                  бұрышы қорапқа қатысты ерікті.
                </p>
                <p>Жаттығу:</p>
                <p>
                  Роботты радардың көру өрісі корапты көргенше онға бұратын бағдарлама жазыныз.
                  Робот токтаганнан кейін оның көру сызығы кораппен мүмкіндігінше жақын қиылысуы
                  керек. Қорапты «тапкан кезде» робот «YES» деп айтуы керек.
                </p>
              </p>
            </>
          )}
          {add === 13 && (
            <>
              <h2 className="readRight__title">№13 практикалық тапсырма</h2>
              <p className="readRight__descr">
                <p>
                  Тақырыбы: <b> Тармақталу</b>
                </p>
                <br />
                <p>
                  1-тапсырма. Робот тырнақтарды оның радарына 10 см кашыктыкта үстап, қол оның көру
                  аймағынан жоғалып кетсе, кысуы керек. Бағдарлама дол 60 секунд жұмыс істеуі керек.
                </p>
                <br />
                <p>2-тапсырма. Бастапқы күй:</p>
                <br />
                <p>
                  Роботтан 60 см қашықтықта қызыл тары бар стенд бар. Стенд Lego Mindstorms
                  нұсқаулығына сәйкес жиналған. Доп роботтың кору аймағында, алайда роботтың айналу
                  бұрышы дәл орнатылмаған. Ойын аланында баска заттар жок.
                </p>
                <p>Жаттығу:</p>
                <p>
                  Робот допка дейін жетуі керек, оны тырнақтарымен алып, бұрылып, бастапкы орнына
                  оралуы керек.
                </p>
                <p>
                  Допка карай козғалу барысында робот өзінің бағытын бірнеше рет реттеуге мәжбүр
                  болуы мүмкін.{' '}
                </p>{' '}
                <br />
                <p>3-тапсырма. Бастапқы күй:</p>
                <p>
                  Жұмыс үстелінде ақ қағаздан жасалған карта бар, оған ерікті пішіндегі қалың қара
                  сызық сызылған. Сызықтың қалыңдығы кем дегенде 2-3 см. Сызықтың киылысуы жоқ.
                  Бұрылыстар кем дегенде 1200 бұрыш жасайды. Сызықтардың бұрылыс радиусы кем дегенде
                  20 см.
                </p>
                <p>Жаттығу:</p>
                <p>
                  Роботты кара сызық бойымен жылжыту программасын жазыңыз. Робот өзінің барлык
                  бұрылыстарынан кейін козгалуы керек.
                </p>
              </p>
            </>
          )}
          {add === 14 && (
            <>
              <h2 className="readRight__title">№14 зертханалық жұмыс. Роботтың алгоритмін құру</h2>
              <p className="readRight__descr">
                <p>1-тапсырма</p>
                <br />
                <p>
                  Роботты берілген кабыргасы бар шаршы бойымен жылжытудын сызықтық алгоритмін
                  күрастырыңыз.
                </p>
                <p>
                  Ең алдымен, сізге кандай командалар кажет екенін, сервомотордың кай бағытта
                  айналуы керектігін, сервомотордың бір жакка козгалу уакытының интервалын жэне
                  командалардың орындалу ретін анықтаңыз.
                </p>{' '}
                <br />
                <p>2-тапсырма</p>
                <p>
                  Сол тапсырманы орындау үшін құрылған сызықтық алгоритмді циклдікке өзгертіңіз.
                </p>
                <br />
                <p>3-тапсырма</p>
                <p>Роботтын үшбұрыштағы козғалысының алгоритмін құрыңыз.</p> <br />
                <p>4-тапсырма</p>
                <p>
                  <ol>
                    <li> 1. Бағыты бар картаны алыны</li>
                    <li> 2. Роботты жинаңыз.</li>
                    <li>3. Алгоритм жазу.</li>
                    <li>4. Аланда тексеріңіз.</li>
                  </ol>
                </p>
              </p>
            </>
          )}
          {add === 15 && (
            <>
              <h2 className="readRight__title">
                №15 зертханалық жұмыс. Робо-сумо программасын құру
              </h2>
              <p className="readRight__descr">
                <br />
                <p>EV3 роботы үшін алгоритм және карапайым робо-сумо программасын кұрайык.</p>
                <br />

                <p>
                  <ol>
                    <li>1. LEGO MINDSTORMS Education EV3 программасында жана бет ашыныз.</li>
                    <li>
                      2. <b>Старт</b> блогына <b>Цикл</b> блогын жалғаңыз.
                    </li>
                    <li>
                      3. <b>Цикл</b> блогына осы <b>Операторларды басқару</b> блогынан{' '}
                      <b>Ауыстырып-қосқышты</b>
                      (Переключатель) жалганыз.
                    </li>
                    <li>
                      4. Датчиктен маліметтерді алу үшін оның режимін ауыстырыныз:{' '}
                      <b>Түс датчигі - Өлшеу</b>
                      (Измерение) - <b>Түс</b> (Цвет).
                    </li>
                    <li>
                      5. <b>Өшіріп-қосқыш</b> блогының үстіңгі жағына Ультрадыбыстық датчик блогын
                      жалғап,
                      <b> Салыстыру</b> (Сравнение) <b>Сантиметр бойынша қашықтық</b> (Расстояние в
                      сантиметрах) параметрін таңдаңыз. <b>Салыстыру типін</b> (Тип сравнение) 2-ге{' '}
                      <b>Шекті мәнін</b>
                      (Пороговое значение) 57-ге теңестіріңіз.
                    </li>
                    <li>
                      6. <b>Ультрадыбыстық датчик</b> блогына <b>Рульдік баскару</b> блогын жалғап,{' '}
                      <b>Қосу</b> режимін тандаңыз.
                    </li>
                    <li>
                      7. <b>Өшіріп-қосқыш </b> блогының томенгі жағына <b>Тәуелсіз баскар</b>у
                      блогын жалғап,
                      <b> Айналым саны бойынша қосу</b> (Включить на количество оборотов) режимін
                      таңдаңыз. Сол жақ мотор қуатын (- 50)-ге, оң жақ мотор қуатын 50-ге, айналым
                      санын 1-ге теңестіріңіз.
                    </li>
                    <li>8. Программаны роботка жүктеніз.</li>
                  </ol>
                </p>
              </p>
            </>
          )}
        </div>
      </div>
    </div>
  );
};
